Blog/routes/web.php

SELECT * FROM `posts` ORDER BY `created_at` DESC
SELECT * FROM `categories`
---
|
*/

Route::get('/', function () {
    return view('posts', [
        'posts' => Post::latest()->get(),
        'categories' => Category::all()
    ]);
})->name('home');